package translator_test

import (
	"testing"

	"github.com/gipsh/yizk/translator"
	"github.com/stretchr/testify/assert"
	"go.uber.org/zap"
	"go.uber.org/zap/zaptest/observer"
)

func TestSplitTextLessThan2k(t *testing.T) {

	translator := translator.TranslatorService{}

	input := translator.PreProcessText("test blabla blabla \n test blabla blabla")

	assert.Equal(t, len(input), 1)

}

func TestSplitTextMoreThan2k(t *testing.T) {

	observedZapCore, _ := observer.New(zap.InfoLevel)
	observedLogger := zap.New(observedZapCore)

	var longString = "מיין ברודער הענען ז\"ל , וועמעס בילדונגס - ניווא איז שוין דאן געווען אַ הויכע און די פאליטישע וועלט שטרעמונגען זענען אים געווען באַקאַנט , און ער האָט מיר דערקלערט די פּאָליטישע באדייטונג פון דעם ליד ( איך מיין אַז ער האָט מיר אויך פאַרבאַטן צו זינגען עס ) און האָט אויך זיך דערקענט אויף דער לינקער טענדענץ פון דעם קרייז וואָס האָט זיך געזאמלט אַרום דער ביבליי אָטעק , מיין ברודער הענען האָט געזען אין דעם דאָזיקן קריין אַ געפאַר פֿאַר דער יונגט פון נאַציאָנאַלן שטאנדפונקט . דעריבער האָט ער פאַררופן די גאַנצע בעסטע יוגנט צוזאַמען מיט דעם עקזיסטירנדיקן ביבליאָטעק קריין , און מען האָט דאָן געגרינדעט אַ גרויסע אַלגעמיינע ביבליאָטעק . די גרעסטע שוועריקייט ביים גרינדן די ביבליאָטעק איז געווען די פראָבלעם פון אַ פּאַסיקער דירה פֿאַר דער זעלבער , אונדזערע עלטערן זענען געווען רעליגיעזע קנאים און האָבן שוין געזאָרגט אז קיין ייך זאָל אונדז ניט פאַרדינגען זיין דירה , אָדער אַ צימער פאַר אונדזער טעטיקייט . דאָס צונויפר קומען זיך צוזאַמען יינגלעך מיט מיידלעך אויף זיצונגען און פאַרזאַמלונגען איז דאן באַטראַכט געוואָרן פֿאַר אַ גרויסע זינד , און ניט איינמאל האָט געטראפן אַז עלטערן פלעגן אַריינקומען צו די פאַרזאַמלונגען און געצווינגען זייערע טעכטער צו גיין אַהיים . טראץ דעם האָבן מיר פארגעזעצט אונדזער ארבעט און מיר האָבן אפילו פראָגרעסירט . מיר האָבן דאן געקראָגן אַ צימער ביי רחל בערגער . איך געדענק די ערשטע אַלגעמיינע פארזאמלונג וואָס איז פארגעקומען אין אונדזער קליינעם קלוב . וואָס פאַראַ גרויסע הכנות פאר דער ערשטער פארזאמלונג ! ווי גרויס איז געווען דער אַלגעמיינער אינטערעס ! אַ יומטובדיקע שטימונג האָט געהערשט אין דעם אוונט פון דער פאַרזאַמלונג , וואָס האָט אויסגעקליבן אַ לייטונג אנצופירן די ביבליאָטעק . און די קולטור - ארבעט . אין דער לייטונג זענען אויסגעוויילט געווארן מיין ברודער הענען ז\"ל ( אלס פאָרזיצער ) , איינע פון די שוועסטער סטאוו ( אַלס וויצעפאָרזיצערן ) . מרדכי זובערמאַן ( סעקרעטאַר ) און שלמה זובערמאן ( קאַסיר ) . "

	translator := translator.TranslatorService{}
	translator.SetLogger(*observedLogger)

	input := translator.PreProcessText(longString)

	assert.Equal(t, 12, len(input))

}
